ERP DEV.КонтурМаркировка/src/DataProcessors/КонтурМаркировка/КонтурМаркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурМаркировка</name>
  <comment>KonturMark.epf</comment>
</mdclass:DataProcessor>

ERP DEV.КонтурМаркировка/src/Catalogs/КонтурМаркировка_Склады/КонтурМаркировка_Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурМаркировка_Склады</name>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурМаркировка_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Идентификатор склада в сервисе Контур.Маркировка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.КонтурМаркировка_Площадки</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСклада1С</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлючаСклада1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.КонтурМаркировка/src/DataProcessors/КонтурМаркировка/Forms/Форма_Склады_Список/Module.bsl
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	
	ОбновитьСписокСкладов();
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСкладов()
	
	Список.Очистить();
	
	ТипыОбъектов = МодульОбъекта().ТипыОбъектовИС();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.GLN КАК GLN,
	|	Т.Организация КАК Организация,
	|	Т.Идентификатор КАК Идентификатор,
	|	Т.Адрес КАК Адрес,
	|	Т.Площадка КАК Площадка,
	|	Т.Комментарий КАК Комментарий,
	|	Т.КлючСклада1С КАК КлючСклада1С,
	|	Т.ТипКлючаСклада1С КАК ТипКлючаСклада1С
	|ИЗ
	|	Справочник.КонтурМаркировка_Склады КАК Т
	|ГДЕ
	|	&ОтборОрганизация";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборОрганизация", "Т.Организация = &Организация");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборОрганизация", "ИСТИНА");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	ТаблицаСкладов = Запрос.Выполнить().Выгрузить();
	
	ТаблицаСкладов.Колонки.Добавить("Склад1С", Новый ОписаниеТипов(ТипыОбъектов.Склад));
	МодульОбъекта().ЗаполнитьВТаблицеОбъекты1СПоКлючам(ТаблицаСкладов, "Склад1С", "КлючСклада1С", "ТипКлючаСклада1С");
	
	ЗначениеВРеквизитФормы(ТаблицаСкладов, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_Склад_Изменен" Тогда
		ОбновитьСписокСкладов();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ТекущийСклад = ТекущиеДанные.Ссылка;
	Если Параметры.РежимВыбора Тогда
		ОповеститьОВыборе(ТекущийСклад);
	Иначе
		МодульКлиента().ОткрытьФормуСклада(ТекущийСклад, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	МодульКлиента().ОткрытьФормуСклада(Элемент.ТекущиеДанные.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МодульКлиента().ОткрытьФормуОрганизации(Организация, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Элементы.Организация.Видимость = ЗначениеЗаполнено(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСклады(Команда)
	
	МодульКлиента().СинхронизироватьСклады(ЭтаФорма);
	
	ОбновитьСписокСкладов();
	
	ПровестиОпросПользователя();
	
КонецПроцедуры

// Опросы пользователей

&НаКлиенте
Процедура ПровестиОпросПользователя()
	
	КлючиСценариев = МодульКлиента().Перечисление_КлючиСценариевДляОпросов();
	ОписаниеОпроса = МодульКлиента().ОпросПользователяПоСценарию(КлючиСценариев.Склады);
	
	Если Не ЗначениеЗаполнено(ОписаниеОпроса) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьФормуОпросаПользователя(ОписаниеОпроса, ЭтаФорма);
	
КонецПроцедуры
